misconfigured.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:examples:usernameservice">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:Petname>
         <petname xsi:type="xsd:string">gero et</petname>
      </urn:Petname>
   </soapenv:Body>
</soapenv:Envelope>
